title: Credential Dumping Tool Execution
id: 7e5d5c3a-9b4f-4d2e-8c1a-9f3e5d7c2a1b
status: stable
description: Detects execution of common credential dumping tools like Mimikatz, LaZagne, ProcDump on LSASS
references:
    - https://attack.mitre.org/techniques/T1003/
    - https://github.com/gentilkiwi/mimikatz
    - https://github.com/AlessandroZ/LaZagne
author: HawkinsOps SOC
date: 2025/01/15
modified: 2025/01/15
tags:
    - attack.credential_access
    - attack.t1003
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - '\mimikatz.exe'
            - '\lazagne.exe'
            - '\procdump.exe'
            - '\procdump64.exe'
            - '\pwdump.exe'
            - '\gsecdump.exe'
            - '\wce.exe'
    selection_cli:
        CommandLine|contains:
            - 'sekurlsa::'
            - 'privilege::debug'
            - 'lsadump::'
            - 'token::elevate'
            - 'vault::cred'
            - 'kerberos::'
            - '-ma lsass'
            - 'invoke-mimikatz'
    selection_hash:
        Hashes|contains:
            - '24be6f30e146034a6f369a0015c12e1c'
    condition: 1 of selection_*
falsepositives:
    - Authorized penetration testing
    - Security research in isolated lab environments
    - Sysinternals ProcDump used for legitimate debugging
level: critical
