title: Linux Log File Deletion
id: 7c8d9e0f-1a2b-3c4d-5e6f-7a8b9c0d1e2f
status: stable
description: Detects deletion or clearing of Linux log files
references:
    - https://attack.mitre.org/techniques/T1070/002/
author: HawkinsOps SOC
date: 2025/01/15
modified: 2025/01/15
tags:
    - attack.defense_evasion
    - attack.t1070.002
logsource:
    product: linux
    service: auditd
detection:
    selection_delete:
        type: 'SYSCALL'
        syscall: 'unlink'
        name|contains: '/var/log/'
    selection_truncate:
        type: 'SYSCALL'
        syscall: 'truncate'
        name|contains: '/var/log/'
    selection_history:
        type: 'EXECVE'
        a0|contains:
            - 'history -c'
            - 'unset HISTFILE'
    condition: 1 of selection_*
falsepositives:
    - Log rotation utilities
    - System maintenance scripts
level: medium
