title: Active Directory Enumeration
id: 2b3c4d5e-6f7a-8b9c-0d1e-2f3a4b5c6d7e
status: stable
description: Detects Active Directory enumeration using PowerShell
references:
    - https://attack.mitre.org/techniques/T1087/002/
author: HawkinsOps SOC
date: 2025/01/15
modified: 2025/01/15
tags:
    - attack.discovery
    - attack.t1087.002
logsource:
    product: windows
    service: powershell
    definition: 'Script Block Logging must be enabled'
detection:
    selection:
        EventID: 4104
        ScriptBlockText|contains:
            - 'Get-ADUser'
            - 'Get-ADGroup'
            - 'Get-ADComputer'
            - 'Get-ADDomain'
            - 'Get-ADForest'
            - 'Get-DomainUser'
            - 'Get-DomainGroup'
    condition: selection
falsepositives:
    - Legitimate AD administration
    - Inventory scripts
level: low
